Revit 2026 API

# ContainerType Enumeration

---

An enumerated type indicating if the field represents a single value or a container of multiple values.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ContainerType
```
```vb
Public Enumeration ContainerType
```
```cpp
public enum class ContainerType
```
```fsharp
type ContainerType
```

| Member name | Value | Description |
| --- | --- | --- |
| Array | 1 | An expandable array of values |
| Map | 2 | An ordered map from keys to values |
| Simple | 0 | One instance of the value included directly |

#### Reference

Autodesk.Revit.DB.ExtensibleStorage Namespace